"--- ALL CATEGORIES ---" = "SEHEMU ZOTE";"--- ALL USERS ---" = "WATUMIZI WOTE";"Add Map" = "Ongeza Ramani";"Add Photo" = "Ongeza Picha";"Add Report" = "Ongeza Ripoti";"Added" = "Imeongezwa";"Adding..." = "Inaongezwa";"All Categories" = "Sehemu zote";"All Checkins By" = " Je, una uhakika unataka kufuta?";"Are you sure you want to cancel?" = "Je, una uhakika unataka kukanusha?";"Are you sure you want to delete?" = "Je, una uhakika unataka kufuta?";"Authenticating..." = "Inahakikisha...";"Bitly Error" = "Kosa la Bitly";"Cancel" = "Kanusha";"Categories..." = "Sehemu";"Category" = "Sehemu";"Clear" = "Futa";"Current Location" = "Pahali ulipo kwa sasa";"Date" = "Tarehe";"Delete Report" = "Ondoa Ripoti";"Description" = "Maelezo";"Done" = "Imekamilika";"Edit" = "Hariri";"email" = "Barua pepe";"Enter description" = "weka maelezo";"Enter first name" = "Andika ";"Error" = "Kosa";"Error Detecting Location" = "Kosa katika kuvumbua pahali";"Error Saving Photo" = "Kosa katika kuhifadhi picha";"Errors" = "Makosa";"first name" = "Jina la kwanza";"From Library" = "Kutoka kwenye maktaba";"I couldn't connect to Twitter. This is most likely a temporary issue, please try again." = "Sikuweza kuunganishwa na Twitter. Yamkini ni jambo la kupita, tafadhali jaribu tena";"Invalid Email" = "Barua pepe sio halisi";"Invalid Email Address" = "Anwani ya barua pepe si halisi";"Invalid Map Details" = "Habari maalum kuhusu ramani si halisi";"Invalid News URL" = "URL la habari si halisi";"last name" = "Jina la mwisho";"Locations..." = "Pahali";"Looks like Twitter is overloaded. Please wait a few seconds and try again." = "Inaonekana Twitter inatumika mno. Tafadhali jaribu baada ya sekunde chache.";"Map" = "Ramani";"Maps" = "Ramani";"Message" = "Ujumbe";"Name" = "Jina";"New Location" = "Pahali mpya";"News" = "Habari";"No" = "Hapana";"No Category Specified" = "Sehemu haijadhihirishwa";"No Date Specified" = "Tarehe haijadhihirishwa";"No Internet" = "Hakuna mtandao";"No Internet Connection" = "Hakuna mtandao";"No Location Specified" = "Pahali haijadhirishwa";"No News" = "Hakuna habari";"No Photos" = "Hakuna picha";"No Reports" = "Hakuna ripoti";"No Video" = "Hakuna video";"Not Specified" = "Haijadhahirishwa";"OK" = "Sawa";"Open In Safari?" = "Fungua ukitumia Safari?";"Password" = "Neno la siri";"Photo" = "Picha";"Photo Added" = "picha imeongezwa";"Photo Error" = "Hitilafu ya picha";"Photo Settings" = "Mipangilio ya picha";"Photos" = "Picha";"Privacy Settings" = "Mipangilio ya faragha";"Remove Error" = "Ondoa kosa";"Remove Photo" = "Ondoa picha";"Removed" = "Imeondolewa";"Report" = "Ripoti";"Reports" = "Ripoti";"Request Error" = "Kosa katika maombi";"Required Fields" = "Sehemu zinazohitajika";"Resized" = "Ukubwa/udogo umebadilishwa";"Resized Image Width" = "Upana wa picha umedabilishwa";"Resizing Photo..." = "Ukubwa/Udogo wa picha unabadilishwa";"Resizing..." = "Ukubwa/Udogo unabadilishwa";"Saved" = "Imehifadhiwa";"Saving..." = "Inahifadhiwa ...";"Search categories..." = "Tafuta sehemu ...";"Search locations..." = "Tafuta pahali ....";"Search maps..." = "Tafuta ramani";"Search reports..." = "Tafuta ripoti";"Select" = "Chagua";"Select category" = "Chagua sehemu";"Select location" = "Chagua pahali";"Select photo" = "Chagua picha";"Send" = "Tuma";"Sending..." = "Inatumwa ...";"Sent" = "Imetumwa";"Settings" = "Mipangilio";"Share Ushahidi iOS" = "Sambaza Ushahidi iOS";"Shortening..." = "Kufupisha";"SMS Failed" = "SMS haikufaulu";"Take Photo" = "Piga picha";"There was a problem adding the photo." = "Hitilafu kuongezwa picha";"There was a problem removing the map." = "Hitilafu kutoa ramani";"There was a problem resizing the photo." = "Hitilafu kupunguza/kuongeza ukubwa wa picha";"This map supports Checkins!\nClick the Filter button to only show checkins for a specific user or the Pin button to checkin now." = "Ramani hii inatumia arifu za pahali ulipo!/";"To checkin, drag the map pin to a more accurate location, then click the Send button after entering an optional message, contact information and photo." = "Kutoa arifu la pahali ulipo";"Tweet" = "Arifu fupi la twitter";"Twitter" = "Twitter";"Twitter Error" = "Kosa la Twitter";"Unable to add incident" = "Tukio halikuongezwa";"Unable To Checkin" = "Arifu la pahali ulipo halikuongezwa";"Unable to checkin, please try again later." = "Arifu la pahali ulipo halikuongezwa, tafadhali jaribu baadaye";"Unable To Send Email" = "Barua pepe haikutumwa";"Unable To Send SMS" = "Ujumbe Mfupi haikutumwa";"Unable To Upload Report" = "Ripoti haikuweza kuongezwa";"Unsaved Changes" = "Mabadiliko hayajihifadhiwa";"Unverified" = "Haijathibitishwa";"Uploaded" = "Imeongezwa";"User Location" = "Pahali pa anayetumia";"Username" = "Jina la anayetumia";"Ushahidi Maps" = "Ramani za Ushahidi";"Verified" = "Imedhihirishwa";"Version" = "Tafsiri";"Video" = "Video";"Yes" = "Ndio";"Your username and password could not be verified. Double check that you entered them correctly and try again." = "Jina lako lako unalotumia hapa na neno la siri hayangethibitishwa. Angalia tena kwamba ni sahihi";